// This JSON configuration file is lenient but keep an eye where you leave trailing commas as they tend to cause issues.
{
    // Chat settings.
    "chat_settings": {
        // Chat cooldown in milliseconds. Set to 0 to disable. Bypass: azure.plugin.chat.can_bypass_cooldown
        "cooldown": 1000,
        // Chat formats. Supports MiniMessage tags and some placeholders.
        "chat_format": {
            // Default chat format used as a fallback. Placeholders: [signature_uuid, player, displayname, group, prefix, suffix, message]
            "default": "<player>: <message>",
            // Console chat format. Placeholders: [player, displayname, group, prefix, suffix, message]
            "console": "[<signature_uuid>] [<group>] <player>: <message>",
            // Per-permission-group formats. Array order works as priority (higher index = more important). Only entry can be applied per player.
            "extra": [
                { "group": "donator", "format": "(Donator) <player>: <message>" },
                { "group": "admin", "format": "(Admin) <player>: <message>" }
            ],
            // Tags allowed inside messages. Tags: [click, color, decorations, font, gradient, hover, insertion, keybind, newline, rainbow, reset, selector, transition, translatable]
            "allowed_tags": {
                // Default tags collection used as a fallback.
                "default": [],
                // Per-permission tags. Array order works as priority (higher index = more important). Only one entry can be applied per player.
                "extra": [
                    { "permission": "azure.plugin.chat.staff_allowed_tags", "tags": ["color", "decorations", "gradient", "rainbow", "reset"] }
                ]
            }
        },
        // Moderation features.
        "moderation": {
            // Message deletion. Messages can be deleted for 5 minutes after being sent.
            "message_deletion": {
                "enabled": true,
                "button": { "position": "before", "text": "<gray>×", "hover": "<gray>Click to delete this message." }
            }
        },
        // Discord webhooks. Forwards chat messages to Discord server using configured webhook.
        "discord_webhooks": {
            "enabled": true,
            "discord_webhook_url": ""
        }
    },
    "resource_pack": {
        // Whether resource pack should be send when player joins the server.
        "send_on_join": true,
        // Marks the resource pack as forced. Player won't be able to join the server without accepting it.
        "is_required": true,
        // Direct downlod URL of the resource pack.
        "pack_url": "",
        // SHA1 checksum of the resource pack. Used for integrity and updates.
        "pack_hash": "",
        // Server message shown in resource pack prompt.
        "prompt_message": "<red>Aby grać na naszym serwerze, musisz zaakceptować paczkę zasobów.",
        // Sound played when player is notified
        "notification_sound": { "key": "minecraft:block.note_block.bell", "source": "master", "volume": 1, "pitch": 0.5 }
    }
}